Code/DataGeneration/openfoam/run/Channel_branch/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
    version	9;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    front
    {
        type            empty;
    }

    back
    {
        type            empty;
    }
	
    bottom
    {
	type		uniformFixedValue;
    	uniformValue
    	{
		type			tableFile;
		format			csv;
		nHeaderLine		1;
		refColumn		0;
		componentColumns	(1);
		separator		",";
		mergeSeparators		no;
        	file			"outlet_p.csv";
    	}
    }

    left
    {
        type            zeroGradient;
    }

    top
    {
        type		zeroGradient;
    }

    right_main
    {
        type            zeroGradient;
    }
    
    right_branch
    {
    	type		uniformFixedValue;
    	uniformValue
    	{
		type			tableFile;
		format			csv;
		nHeaderLine		1;
		refColumn		0;
		componentColumns	(1);
		separator		",";
		mergeSeparators		no;
        	file			"outlet_p.csv";
    	}
    }
}

// ************************************************************************* //
