Code/DataGeneration/openfoam/run/Channel_branch/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    back 
    {
        type            empty;
        physicalType    patch;
        nFaces          831;
        startFace       1189;
    }
    front 
    {
        type            empty;
        physicalType    patch;
        nFaces          831;
        startFace       2020;
    }
    left 
    {
        type            wall;
        physicalType    patch;
        nFaces          40;
        startFace       2851;
    }
    top
    {
        type            patch;
        physicalType    patch;
        nFaces          8;
        startFace       2891;
    }
    right_main 
    {
        type            wall;
        physicalType    patch;
        nFaces          55;
        startFace       2899;
    }
    right_branch
    {
        type            patch;
        physicalType    patch;
        nFaces          4;
        startFace       2954;
    }
    bottom
    {
        type            patch;
        physicalType    patch;
        nFaces          8;
        startFace       2958;
    }
)

// ************************************************************************* //
