Code/DataGeneration/openfoam/run/Channel_branch/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


solvers
{
    p
    {
        solver          PCG;
	preconditioner 	DIC;
        tolerance       1e-06;
        relTol          0.05;
    }

   pFinal
    {
	$p;
        relTol          0;
    }

    U
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-05;
        relTol          0;
    }

    UFinal
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-05;
        relTol          0;
    }


    omega
    {
	solver		PCG;
	preconditioner	DIC;
	tolerance	1e-08;
	relTol		0;
	minIter		3;
    }

    omegaFinal
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-05;
        relTol          0;
    }

    k
    {
	solver		PCG;
	preconditioner	DIC;
	tolerance	1e-08;
	relTol		0;
	minIter		3;
    }

    kFinal
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-05;
        relTol          0;
    }

}

PIMPLE
{
   nOuterCorrectors 1;
   nCorrectors     3;
   nNonOrthogonalCorrectors 1;



relaxationFactors
{
    fields
    {
	p		0.3;
    }
    equations
    {
	U		0.7;
	k		0.7;
	omega		0.7;
    }
}


// ************************************************************************* //
